[{"name":"Udemy for Education","ring":"Adopt","quadrant":"Platforms","isNew":"TRUE","status":"moved in", "description":"<p><strong><a href=\"https://business.udemy.com/udemy-for-business/\">Udemy for Education</a></strong> is the online learning and professional development platform used by Campus CodeWorks. Udemy provides access to a large course library covering technical skills, programming languages and professional development topics. Our teams use Udemy for employee training, skill development and keeping up with technology trends. The platform's structured learning paths, video-based content and progress-tracking features make both individual learning and team-wide upskilling effective. Udemy's integration options and reporting support Campus CodeWorks in tracking learning progress and ensuring continuous professional development across the organisation.</p>"},{"name":"Angular","ring":"Adopt","quadrant":"Languages & Frameworks","isNew":"FALSE","description":"<p><strong><a href=\"https://angular.io/\">Angular</a></strong> is Campus CodeWorks' standard choice for building modern web applications and client portals. Our development teams use Angular in key projects, including the Neptun, KVAR and e-Titán systems. Angular's comprehensive framework with built-in routing, forms, HTTP client and dependency injection accelerates development of complex enterprise applications. Its structured approach and TypeScript-first philosophy ensure consistency across teams and projects. Angular's strong tooling, testing capabilities and enterprise-grade architecture make it ideal for large-scale applications requiring maintainability and long-term support.</p>"},{"name":"Telerik Kendo UI","ring":"Adopt","quadrant":"Languages & Frameworks","isNew":"FALSE","description":"<p><strong><a href=\"https://www.telerik.com/kendo-ui\">Telerik Kendo UI</a></strong> is the UI component library in use at Campus CodeWorks. Kendo UI provides a comprehensive set of components for building modern web applications, including data grids, form controls, calendars, charts and other interactive UI elements. Our teams use Kendo UI to build consistent, professional user interfaces that enable rapid development and easy maintainability. The library's strong Angular integration and TypeScript support align well with the Campus CodeWorks technology stack. Kendo UI's extensive documentation and support help developers implement UI components effectively.</p>"},{"name":"TypeScript","ring":"Adopt","quadrant":"Languages & Frameworks","isNew":"FALSE","description":"<p><strong><a href=\"https://www.typescriptlang.org/\">TypeScript</a></strong> is highly valuable for Campus CodeWorks development teams working on large-scale applications. The type safety it provides reduces bugs and improves code maintainability, which is critical for systems where data accuracy is paramount. TypeScript's excellent IDE support and incremental adoption path allow teams to migrate existing JavaScript codebases step by step. We recommend TypeScript for every new Campus CodeWorks web application project.</p>"},{"name":"C#","ring":"Adopt","quadrant":"Languages & Frameworks","isNew":"FALSE","description":"<p><strong><a href=\"https://dotnet.microsoft.com/en-us/languages/csharp\">C#</a></strong> is Campus CodeWorks' primary backend development language for all projects. C# together with the .NET platform provides a robust, type-safe and performant foundation for enterprise applications, microservices and APIs. Our teams leverage C#'s strong type system, excellent tooling and comprehensive standard library to build reliable backend services. The language's integration with the .NET ecosystem—including ASP.NET Core, Entity Framework and modern async/await patterns—makes it ideal for building scalable backend systems. We use C# across the full Campus CodeWorks backend infrastructure, ensuring consistency and maintainability across projects.</p>"},{"name":".NET 10","ring":"Adopt","quadrant":"Languages & Frameworks","isNew":"FALSE","description":"<p><strong><a href=\"https://dotnet.microsoft.com/\">.NET 10</a></strong> is the .NET platform version used by Campus CodeWorks in its products. .NET 10 delivers improved performance, better memory management and new features that enhance application efficiency and scalability. Our teams use .NET 10 for backend services, APIs and microservices. The platform provides modern development patterns, strong tooling support and comprehensive libraries that support writing efficient and maintainable code. .NET 10's long-term support and stability are critical for Campus CodeWorks products.</p>"},{"name":"Kotlin","ring":"Adopt","quadrant":"Languages & Frameworks","isNew":"FALSE","description":"<p><strong><a href=\"https://kotlinlang.org/\">Kotlin</a></strong> is Campus CodeWorks' standard language for mobile application development, especially on Android. Kotlin's modern syntax, null-safety support and interoperability with Java make it an excellent choice for mobile development. Our mobile development teams use Kotlin to build native Android applications with improved code readability and less boilerplate than Java. Kotlin's coroutines support enables efficient asynchronous programming, which is essential for mobile apps that handle network requests and background work. The language's strong tooling and growing ecosystem make it our primary choice for mobile development projects.</p>"},{"name":"Rust","ring":"Assess","quadrant":"Languages & Frameworks","isNew":"TRUE","description":"<p><strong><a href=\"https://www.rust-lang.org/\">Rust</a></strong> is receiving increasing attention in Campus CodeWorks technology discussions, especially for performance-critical systems and security-sensitive applications. Although Rust's memory-safety guarantees are attractive for systems handling sensitive data, the learning curve is steep compared to languages our teams already know. We evaluate Rust for specific use cases such as high-performance data pipelines and security-critical microservices, but it is not yet ready for broad adoption in our development workflows.</p>"},{"name":"Go","ring":"Assess","quadrant":"Languages & Frameworks","isNew":"TRUE","description":"<p><strong><a href=\"https://go.dev/\">Go</a></strong> is a potential language under evaluation by Campus CodeWorks for backend services, microservices and cloud-native applications. Go's simplicity, fast compilation, strong concurrency support with goroutines and solid standard library make it attractive for building scalable backend systems. The language's performance characteristics and built-in tooling for testing and profiling are appealing for high-throughput services. However, our teams currently have strong expertise in C# and .NET, so we are assessing whether Go's benefits would justify the learning curve and ecosystem shift. We evaluate Go for specific use cases such as microservices, API gateways and CLI tools where its strengths offer clear advantages.</p>"},{"name":"Delphi","ring":"Hold","quadrant":"Languages & Frameworks","isNew":"FALSE","description":"<p><strong><a href=\"https://www.embarcadero.com/products/delphi\">Delphi</a></strong> is a legacy programming language and IDE still used by Campus CodeWorks in some existing projects, especially desktop applications and older client systems. Although Delphi was once a popular choice for Windows desktop development, it has become outdated compared to modern web and cross-platform technologies. The ecosystem is shrinking, developer expertise is scarce, and integration with modern cloud services and APIs is challenging. We do not recommend Delphi for new projects and advise migrating existing Delphi applications to modern frameworks such as .NET/C# or Angular where possible.</p>"},{"name":"Vue.js","ring":"Hold","quadrant":"Languages & Frameworks","isNew":"FALSE","description":"<p><strong><a href=\"https://vuejs.org/\">Vue.js</a></strong> is a frontend framework previously used by Campus CodeWorks but no longer recommended for new projects. Although Vue.js's progressive approach and gentle learning curve can be appealing, Campus CodeWorks' standard frontend framework is Angular, which fits better with our existing technology stack and team expertise. Maintaining existing projects that use Vue.js remains possible, but we recommend Angular for new projects for consistency and long-term support.</p>"},{"name":"Docker","ring":"Assess","quadrant":"Tools","isNew":"TRUE","description":"<p><strong><a href=\"https://www.docker.com/\">Docker</a></strong> has become essential for containerising Campus CodeWorks applications and ensuring consistent deployments across development, test and production environments. Our teams use Docker to package applications, integrations and administrative tools. Containerisation simplifies dependency management and makes it easier to scale services. Docker Compose is especially useful for local development environments, allowing developers to spin up complex application stacks with databases, cache layers and microservices quickly.</p>"},{"name":"Kubernetes","ring":"Assess","quadrant":"Tools","isNew":"TRUE","description":"<p><strong><a href=\"https://kubernetes.io/\">Kubernetes</a></strong> is under evaluation by Campus CodeWorks for large-scale orchestration of containerised applications. Although Kubernetes offers strong capabilities for managing complex microservices architectures, it introduces significant operational complexity. Our teams evaluate Kubernetes for scenarios where high availability and automatic scaling are critical, such as client portal systems during peak periods. For smaller projects, simpler container orchestration solutions may be more appropriate.</p>"},{"name":"Jenkins","ring":"Hold","quadrant":"Tools","isNew":"FALSE","description":"<p><strong><a href=\"https://www.jenkins.io/\">Jenkins</a></strong> was once the workhorse for CI/CD pipelines at Campus CodeWorks, but we see teams migrating to modern alternatives. Although Jenkins is highly configurable and has extensive plugin support, its interface feels dated and the maintenance burden is significant. Newer CI/CD platforms such as GitHub Actions and GitLab CI offer a better developer experience and tighter integration with version control. We recommend that teams starting new projects evaluate modern alternatives, although existing Jenkins installations can continue to serve their purpose.</p>"},{"name":"GitHub Actions","ring":"Adopt","quadrant":"Tools","isNew":"FALSE","description":"<p><strong><a href=\"https://github.com/features/actions\">GitHub Actions</a></strong> is Campus CodeWorks' preferred CI/CD solution for projects hosted on GitHub. Tight integration with GitHub repositories, simple YAML-based configuration and a generous free tier for educational institutions make it an excellent choice. Our teams use GitHub Actions for automated testing, deployment to staging environments and documentation generation. The built-in Actions marketplace simplifies common tasks such as running tests, building Docker images and deploying to cloud platforms.</p>"},{"name":"TFS / Azure DevOps","ring":"Adopt","quadrant":"Tools","isNew":"FALSE","description":"<p><strong><a href=\"https://azure.microsoft.com/en-us/products/devops\">TFS / Azure DevOps</a></strong> is the version control and project management platform in daily use at Campus CodeWorks. Azure DevOps provides an integrated solution for version control, build and release pipelines, work item tracking and testing. Our teams use TFS/Azure DevOps daily for code storage, CI/CD pipeline management and project tracking. The platform's comprehensive toolset enables managing the full development lifecycle in one place, improving collaboration and project visibility.</p>"},{"name":"Confluence","ring":"Adopt","quadrant":"Tools","isNew":"FALSE","description":"<p><strong><a href=\"https://www.atlassian.com/software/confluence\">Confluence</a></strong> is the documentation and knowledge management platform in daily use at Campus CodeWorks. Confluence enables teams to store, organise and share documentation, technical specifications and project information centrally. Our teams use Confluence daily for writing documentation, storing meeting notes, maintaining technical descriptions and building knowledge bases. The platform's search and structured pages support quick access to information and knowledge sharing across the organisation.</p>"},{"name":"PostgreSQL","ring":"Trial","quadrant":"Platforms","isNew":"TRUE","description":"<p><strong><a href=\"https://www.postgresql.org/\">PostgreSQL</a></strong> is being trialed by Campus CodeWorks as the standard relational database, chosen for its reliability, feature richness and open-source nature. PostgreSQL's advanced features—including JSON support, full-text search and robust transaction handling—make it suitable for diverse use cases. The database's strong ACID compliance and data integrity features are critical for applications handling sensitive data. Its active community and comprehensive documentation effectively support our development teams.</p>"},{"name":"MongoDB","ring":"Assess","quadrant":"Platforms","isNew":"TRUE","description":"<p><strong><a href=\"https://www.mongodb.com/\">MongoDB</a></strong> is evaluated by Campus CodeWorks as a database for flexible-schema applications such as content management systems and analytics platforms. MongoDB's document model fits scenarios where data structures change frequently, which is common in educational technology projects. However, our teams are cautious about using MongoDB for applications that require complex transactions or strict data consistency. We recommend MongoDB for specific use cases such as storing course content, portfolios and event data where schema flexibility offers clear benefits.</p>"},{"name":"Redis","ring":"Trial","quadrant":"Platforms","isNew":"TRUE","description":"<p><strong><a href=\"https://redis.io/\">Redis</a></strong> is being trialed by Campus CodeWorks as the standard cache and session store for web applications. Redis significantly improves performance in high-traffic systems. Our teams use Redis for caching frequently accessed data, managing user sessions and implementing rate limiting. Redis pub/sub capabilities enable real-time features such as live notifications and chat systems. The in-memory database's speed and simplicity make it an essential component in the Campus CodeWorks application architecture.</p>"},{"name":"RabbitMQ","ring":"Adopt","quadrant":"Platforms","isNew":"TRUE","description":"<p><strong><a href=\"https://www.rabbitmq.com/\">RabbitMQ</a></strong> is Campus CodeWorks' standard message broker for event-driven and microservices-based systems, including the KAV exam orchestration system. RabbitMQ enables reliable, asynchronous communication between services via queues and topics, improving decoupling and flexibility. Our teams use RabbitMQ for domain events, integration events and background processing workloads. RabbitMQ's mature ecosystem and proven stability make it a core component of our backend platform.</p>"},{"name":"MinIO","ring":"Trial","quadrant":"Platforms","isNew":"TRUE","description":"<p><strong><a href=\"https://min.io/\">MinIO</a></strong> is being trialed by Campus CodeWorks as a self-hosted, S3-compatible object storage platform, primarily in systems such as the KAV exam orchestration solution. MinIO provides durable, highly available storage for documents, certificates and archived files in Kubernetes environments. The solution fits well with containerised and on-premise infrastructure, but should be compared in the long term with cloud alternatives (e.g. S3) from an operational and cost perspective.</p>"},{"name":"AWS","ring":"Adopt","quadrant":"Platforms","isNew":"TRUE","description":"<p><strong><a href=\"https://aws.amazon.com/\">Amazon Web Services (AWS)</a></strong> is Campus CodeWorks' primary cloud platform for hosting applications and services. AWS's education discount programme and broad service offering make it an excellent choice for institutions of all sizes. Our teams use AWS services such as EC2 for compute, RDS for managed databases, S3 for storage and CloudFront for content delivery. AWS's compliance certifications and security features are essential for handling educational data. The platform's scalability supports peak loads during registration periods and semester starts.</p>"},{"name":"Microservices architecture","ring":"Assess","quadrant":"Techniques","isNew":"TRUE","description":"<p><strong>Microservices architecture</strong> is an approach under evaluation by Campus CodeWorks for breaking large, monolithic systems into smaller, independently deployable services. This approach can improve development speed and allow different teams to work on different services. However, our teams' experience is that microservices introduce significant operational complexity, including service discovery, distributed tracing and data consistency challenges. We recommend microservices only for projects with mature DevOps practices and clear boundaries between system domains. For smaller projects, a well-structured monolith may be more appropriate.</p>"},{"name":"API-first design","ring":"Adopt","quadrant":"Techniques","isNew":"FALSE","description":"<p><strong>API-first design</strong> has become standard practice for Campus CodeWorks development teams. By designing APIs before building user interfaces, teams can ensure consistent data access patterns across web, mobile and third-party integrations. This approach is especially valuable for systems where data must be accessible from multiple channels, including client portals, mobile applications and administrative tools. API-first design enables better separation of concerns and simplifies integration with other platforms.</p>"},{"name":"Infrastructure as Code","ring":"Assess","quadrant":"Techniques","isNew":"TRUE","description":"<p><strong>Infrastructure as Code (IaC)</strong> with tools such as Terraform and CloudFormation has transformed how Campus CodeWorks manages cloud resources. IaC enables version-controlled infrastructure, repeatable deployments and easier disaster recovery. Our teams use IaC to provision databases, compute instances and network resources for Campus CodeWorks applications. This approach reduces manual configuration errors and enables faster recovery from infrastructure failures. IaC is especially valuable for multi-environment setups where development, staging and production environments must stay consistent.</p>"},{"name":"Continuous Integration/Continuous Deployment","ring":"Adopt","quadrant":"Techniques","isNew":"FALSE","description":"<p><strong>Continuous Integration/Continuous Deployment (CI/CD)</strong> pipelines have become standard practice for Campus CodeWorks development teams. Automated testing and deployment reduce the risk of introducing defects into production systems. CI/CD enables faster delivery of features and fixes, which is critical for responding to changing requirements. Our teams use CI/CD for running automated tests, security scanning and deployment to staging environments before manual production releases.</p>"},{"name":"Event-driven architecture","ring":"Assess","quadrant":"Techniques","isNew":"TRUE","description":"<p><strong>Event-driven architecture</strong> is an approach under evaluation by Campus CodeWorks for integrating systems that must react to changes in real time. For example, when a user registers for a service, multiple systems may need to be notified. Event-driven patterns using message queues or event streams can decouple these systems and improve flexibility. However, implementing event-driven architecture requires careful design for event ordering, idempotency and error handling. We evaluate this pattern for specific integration scenarios where loose coupling offers clear benefits.</p>"},{"name":"Single Sign-On (SSO)","ring":"Adopt","quadrant":"Techniques","isNew":"FALSE","description":"<p><strong>Single Sign-On (SSO)</strong> with protocols such as SAML and OAuth is essential for providing seamless access to Campus CodeWorks applications. SSO improves the user experience by removing the need to remember multiple passwords while improving security through centralised authentication. Campus CodeWorks uses SSO to integrate various systems, client portals and administrative tools. SSO also enables better access control and audit trails, which are critical for compliance requirements.</p>"},{"name":"Data warehousing for analytics","ring":"Assess","quadrant":"Techniques","isNew":"TRUE","description":"<p><strong>Data warehousing for analytics</strong> enables Campus CodeWorks to gain insights from operational data across different systems. By consolidating data from multiple sources into a data warehouse, our analytics teams can run research, track metrics and generate reports. Data warehousing supports use cases such as identifying at-risk users, analysing performance rates and optimising resource allocation. We use ETL processes to regularly sync operational systems with the warehouse while maintaining data privacy and security.</p>"},{"name":"Mobile-first design","ring":"Adopt","quadrant":"Techniques","isNew":"FALSE","description":"<p><strong>Mobile-first design</strong> is essential for Campus CodeWorks applications, as users increasingly access services from smartphones and tablets. Our teams prioritise mobile experience for registrations, maps, event calendars and client portals. Mobile-first design ensures that critical functionality is accessible on small screens and touch interfaces. Responsive web design and progressive web app (PWA) techniques enable app-like experiences without native app development across all platforms. Mobile-first thinking has become standard practice for every new Campus CodeWorks application project.</p>"},{"name":"Container orchestration","ring":"Assess","quadrant":"Techniques","isNew":"TRUE","description":"<p><strong>Container orchestration</strong> with platforms such as Kubernetes is an approach under evaluation by Campus CodeWorks for managing complex application deployments. Container orchestration enables automatic scaling, self-healing and rolling updates, which are valuable for highly available systems. However, orchestration platforms introduce significant operational complexity and require expertise. Our teams are assessing whether the benefits justify the learning curve and maintenance burden. For smaller projects, simpler deployment strategies may be more appropriate, while larger projects with dedicated DevOps teams may benefit from orchestration capabilities.</p>"},{"name":"Serverless architecture","ring":"Assess","quadrant":"Techniques","isNew":"TRUE","description":"<p><strong>Serverless architecture</strong> with platforms such as AWS Lambda and Azure Functions is an approach under evaluation by Campus CodeWorks for specific use cases. Serverless can reduce operational burden by eliminating server management and enabling automatic scaling. Our teams evaluate serverless for event-driven integrations, scheduled tasks such as data sync, and API endpoints with variable traffic patterns. However, serverless introduces challenges around cold starts, debugging and vendor lock-in. We evaluate serverless for specific scenarios where benefits outweigh trade-offs, not as a full replacement for traditional server-based architectures.</p>"},{"name":"Observability and monitoring","ring":"Adopt","quadrant":"Techniques","isNew":"FALSE","description":"<p><strong>Observability and monitoring</strong> with tools such as Prometheus, Grafana and application performance monitoring (APM) solutions is essential for maintaining reliable Campus CodeWorks services. In more complex systems such as the KAV exam orchestration platform, we complement this with an EFK stack (Elasticsearch, Fluentd/Fluent Bit, Kibana) for centralised logging and OpenTelemetry-based tracing (Jaeger/Tempo). Comprehensive monitoring enables our teams to detect issues before they impact users, understand system performance during peak periods and resolve problems quickly. We implement multi-level monitoring: infrastructure metrics, application performance and business metrics. Effective observability is critical for maintaining service-level agreements and ensuring a positive user experience.</p>"},{"name":"MSSQL","ring":"Adopt","quadrant":"Platforms","isNew":"TRUE","description":"<p><strong><a href=\"https://www.microsoft.com/sql-server\">Microsoft SQL Server (MSSQL)</a></strong> is the relational database management system in use at Campus CodeWorks. Our teams use MSSQL for enterprise applications where the Windows ecosystem and .NET integration are primary. MSSQL's strong transaction handling, security features and Azure SQL integration options provide a reliable choice for storing critical business data.</p>"},{"name":"Oracle","ring":"Adopt","quadrant":"Platforms","isNew":"TRUE","description":"<p><strong><a href=\"https://www.oracle.com/database/\">Oracle Database</a></strong> is the relational database system in use at Campus CodeWorks. We use Oracle in projects and with clients where existing Oracle infrastructure or licensing agreements are already in place. Oracle's strong data integrity and scalability capabilities meet enterprise requirements.</p>"},{"name":"ELK Stack","ring":"Adopt","quadrant":"Platforms","isNew":"TRUE","description":"<p><strong><a href=\"https://www.elastic.co/elasticstack\">ELK Stack</a></strong> (Elasticsearch, Logstash, Kibana) is the centralised log collection, search and visualisation platform in use at Campus CodeWorks. Our teams use the ELK stack to collect, search and build dashboards from application and infrastructure logs. The stack complements the observability strategy with support for detailed log analysis and debugging.</p>"},{"name":"ChatGPT","ring":"Adopt","quadrant":"Tools","isNew":"TRUE","description":"<p><strong><a href=\"https://chat.openai.com/\">ChatGPT</a></strong> is the AI-based assistant in use at Campus CodeWorks for documentation, code examples and general development questions. Our teams use ChatGPT for quick information lookup, drafting templates and documents, and brainstorming. The tool supports productivity while we adhere to organisational data-handling guidelines.</p>"},{"name":"Cursor AI","ring":"Trial","quadrant":"Tools","isNew":"TRUE","description":"<p><strong><a href=\"https://cursor.com/\">Cursor AI</a></strong> is not currently in use at Campus CodeWorks but is worth considering for adoption. Cursor is an AI-powered code editor that provides context-aware suggestions and code generation for developers. Before adoption, it should be trialled for compatibility with security and data-handling policies.</p>"},{"name":"Claude Code","ring":"Assess","quadrant":"Tools","isNew":"TRUE","description":"<p><strong><a href=\"https://claude.ai/\">Claude (Claude Code)</a></strong> is not currently in use at Campus CodeWorks; evaluation is recommended. The Anthropic-built AI assistant provides code interpretation, documentation and development support. Fit with organisational needs, licensing and use alongside existing AI tools (e.g. ChatGPT) should be evaluated.</p>"},{"name":"Proxmox VE","ring":"Assess","quadrant":"Platforms","isNew":"TRUE","description":"<p><strong><a href=\"https://www.proxmox.com/\">Proxmox VE</a></strong> is not currently in use; evaluation is recommended to expand virtualisation. Proxmox is an open-source, KVM- and LXC-based virtualisation platform for managing on-premise servers and VMs. Compatibility with existing infrastructure and operational costs should be evaluated.</p>"},{"name":"VMware ESXi","ring":"Assess","quadrant":"Platforms","isNew":"TRUE","description":"<p><strong><a href=\"https://www.vmware.com/products/esxi-and-esx.html\">VMware ESXi</a></strong> is not currently in use; evaluation is recommended for introducing or expanding virtualisation. ESXi is an industry-standard hypervisor for highly available, scalable virtual environments. Licensing costs should be evaluated against Proxmox and other alternatives, along with fit for the organisation's virtualisation strategy.</p>"}]
