[
  
  {
    "name": "Udemy for Education",
    "ring": "Adopt",
    "quadrant": "Platforms",
    "isNew": "TRUE",
    "description": "<p><strong><a href=\"https://business.udemy.com/udemy-for-business/\">Udemy for Education</a></strong> a Campus CodeWorks által használt online tanulási és szakmai fejlesztési platform. Az Udemy hozzáférést biztosít egy hatalmas kurzus könyvtárhoz, amely technikai készségeket, programozási nyelveket és szakmai fejlesztési témákat fed le. Csapataink az Udemy-t használják alkalmazottképzéshez, készségfejlesztéshez és a technológiai trendek követéséhez. A platform strukturált tanulási útvonalai, videó-alapú tartalma és haladás követési funkciói hatékonyvá teszik mind az egyéni tanulást, mind a csapat szintű készségfejlesztési kezdeményezéseket. Az Udemy integrációs lehetőségei és jelentéskészítő funkciói segítik a Campus CodeWorks-t a tanulási haladás követésében és a folyamatos szakmai fejlesztés biztosításában a szervezetben.</p>"
  },
  {
    "name": "Angular",
    "ring": "Adopt",
    "quadrant": "Languages & Frameworks",
    "isNew": "FALSE",
    "description": "<p><strong><a href=\"https://angular.io/\">Angular</a></strong> a Campus CodeWorks standard választása modern webalkalmazások és ügyfélportálok építéséhez. Fejlesztői csapataink az Angular-t használják kulcsfontosságú projektekben, beleértve a Neptun, KVAR és e-Titán rendszereket. Az Angular átfogó keretrendszere beépített routing, form, HTTP kliens és dependency injection funkciókkal felgyorsítja az összetett vállalati alkalmazások fejlesztését. A keretrendszer strukturált megközelítése és TypeScript-first filozófiája konzisztenciát biztosít csapatok és projektek között. Az Angular erős tooling támogatása, tesztelési képességei és vállalati szintű architektúrája ideálissá teszi nagy léptékű alkalmazásokhoz, amelyek karbantarthatóságot és hosszú távú támogatást igényelnek.</p>"
  },
  {
    "name": "Telerik Kendo UI",
    "ring": "Adopt",
    "quadrant": "Languages & Frameworks",
    "isNew": "FALSE",
    "description": "<p><strong><a href=\"https://www.telerik.com/kendo-ui\">Telerik Kendo UI</a></strong> a Campus CodeWorks által használatban lévő UI komponens könyvtár. A Kendo UI átfogó komponens készletet nyújt modern webalkalmazások fejlesztéséhez, beleértve adatrácsokat, form elemeket, naptárakat, diagramokat és egyéb interaktív UI komponenseket. Csapataink a Kendo UI-t használják konzisztens, professzionális felhasználói felületek építéséhez, amelyek gyors fejlesztést és könnyű karbantarthatóságot tesznek lehetővé. A könyvtár erős Angular integrációja és TypeScript támogatása jól illeszkedik a Campus CodeWorks technológiai stack-jéhez. A Kendo UI kiterjedt dokumentációja és támogatása segíti a fejlesztőket hatékony UI komponensek implementálásában.</p>"
  },
  {
    "name": "TypeScript",
    "ring": "Adopt",
    "quadrant": "Languages & Frameworks",
    "isNew": "FALSE",
    "description": "<p><strong><a href=\"https://www.typescriptlang.org/\">TypeScript</a></strong> kiemelkedően értékes a Campus CodeWorks fejlesztői csapatai számára nagy léptékű alkalmazásokon dolgozva. A típusbiztonság, amit biztosít, csökkenti a hibákat és javítja a kód karbantarthatóságát, ami kritikus fontosságú olyan rendszereknél, ahol az adatok pontossága döntő. A TypeScript kiváló IDE támogatása és fokozatos bevezetési lehetősége lehetővé teszi a csapatok számára, hogy lépésről lépésre migrálják meglévő JavaScript kódbázisaikat. A TypeScript-et ajánljuk minden új Campus CodeWorks webalkalmazás projekthez.</p>"
  },
  {
    "name": "C#",
    "ring": "Adopt",
    "quadrant": "Languages & Frameworks",
    "isNew": "FALSE",
    "description": "<p><strong><a href=\"https://dotnet.microsoft.com/en-us/languages/csharp\">C#</a></strong> a Campus CodeWorks elsődleges backend fejlesztési nyelve minden projektben. A C# a .NET platformmal együtt robusztus, típusbiztos és teljesítményes platformot biztosít vállalati alkalmazások, microservices és API-k fejlesztéséhez. Csapataink kihasználják a C# erős típusrendszerét, kiváló eszközeit és átfogó standard könyvtárát megbízható backend szolgáltatások fejlesztéséhez. A nyelv integrációja a .NET ökoszisztémával, beleértve az ASP.NET Core-t, Entity Framework-öt és modern async/await mintákat, ideálissá teszi skálázható backend rendszerek építéséhez. A C#-ot a Campus CodeWorks teljes backend infrastruktúrájában használjuk, biztosítva a konzisztenciát és karbantarthatóságot projektek között.</p>"
  },
  {
    "name": ".NET 10",
    "ring": "Adopt",
    "quadrant": "Languages & Frameworks",
    "isNew": "FALSE",
    "description": "<p><strong><a href=\"https://dotnet.microsoft.com/\">.NET 10</a></strong> a Campus CodeWorks által termékekben használt .NET platform verziója. A .NET 10 továbbfejlesztett teljesítményt, jobb memóriakezelést és új funkciókat nyújt, amelyek javítják az alkalmazások hatékonyságát és skálázhatóságát. Csapataink a .NET 10-et használják backend szolgáltatások, API-k és microservices fejlesztéséhez. A platform modern fejlesztési mintákat, erős tooling támogatást és átfogó könyvtárakat biztosít, amelyek segítik a hatékony és karbantartható kód írását. A .NET 10 hosszú távú támogatása és stabilitása kritikus fontosságú a Campus CodeWorks termékei számára.</p>"
  },
  {
    "name": "Kotlin",
    "ring": "Adopt",
    "quadrant": "Languages & Frameworks",
    "isNew": "FALSE",
    "description": "<p><strong><a href=\"https://kotlinlang.org/\">Kotlin</a></strong> a Campus CodeWorks standard nyelve mobilalkalmazás fejlesztéshez, különösen Android platformokhoz. A Kotlin modern szintaxisa, null safety támogatása és Java-val való interoperabilitása kiváló választást jelent mobil fejlesztéshez. Mobil fejlesztői csapataink a Kotlin-t használják natív Android alkalmazások építéséhez, javított kód olvashatósággal és kevesebb boilerplate kóddal a Java-hoz képest. A Kotlin coroutines támogatása lehetővé teszi a hatékony aszinkron programozást, ami elengedhetetlen mobilalkalmazások számára, amelyek hálózati kéréseket és háttérfeladatokat kezelnek. A nyelv erős tooling támogatása és növekvő ökoszisztémája teszik elsődleges választásunkká mobil fejlesztési projektekhez.</p>"
  },
  {
    "name": "Rust",
    "ring": "Assess",
    "quadrant": "Languages & Frameworks",
    "isNew": "TRUE",
    "description": "<p><strong><a href=\"https://www.rust-lang.org/\">Rust</a></strong> egyre nagyobb figyelmet kap a Campus CodeWorks technológiai megbeszéléseiben, különösen teljesítmény-kritikus rendszerekhez és biztonság-érzékeny alkalmazásokhoz. Bár a Rust memóriabiztonsági garanciái vonzóak olyan rendszerekhez, amelyek érzékeny adatokat kezelnek, a tanulási görbe meredek a csapataink által már ismert nyelvekhez képest. A Rust-ot specifikus használati esetekhez értékeljük, mint például nagy teljesítményű adatfeldolgozó pipeline-ok és biztonság-kritikus microservices, de még nem kész a széles körű bevezetésre fejlesztési munkafolyamatainkban.</p>"
  },
  {
    "name": "Go",
    "ring": "Assess",
    "quadrant": "Languages & Frameworks",
    "isNew": "TRUE",
    "description": "<p><strong><a href=\"https://go.dev/\">Go</a></strong> a Campus CodeWorks által értékelt potenciális nyelv backend szolgáltatásokhoz, microservices-hez és cloud-native alkalmazásokhoz. A Go egyszerűsége, gyors fordítása, kiváló konkurencia támogatása goroutines-szel és erős standard könyvtára vonzóvá teszi skálázható backend rendszerek építéséhez. A nyelv teljesítmény jellemzői és beépített tooling támogatása teszteléshez és profilozáshoz vonzó nagy átviteli sebességű szolgáltatásokhoz. Azonban csapataink jelenleg erős szakértelemmel rendelkeznek a C# és .NET területén, ezért értékeljük, hogy a Go előnyei megérnék-e a tanulási görbét és ökoszisztéma migrációt. A Go-t specifikus használati esetekhez értékeljük, mint például microservices, API gateway-ek és CLI eszközök, ahol az erősségei egyértelmű előnyöket nyújtanak.</p>"
  },
  {
    "name": "Delphi",
    "ring": "Hold",
    "quadrant": "Languages & Frameworks",
    "isNew": "FALSE",
    "description": "<p><strong><a href=\"https://www.embarcadero.com/products/delphi\">Delphi</a></strong> egy örökölt programozási nyelv és IDE, amelyet a Campus CodeWorks még mindig használ néhány meglévő projektben, különösen asztali alkalmazásokban és régebbi ügyfélrendszerekben. Bár a Delphi egykor népszerű választás volt Windows asztali fejlesztéshez, elavulttá vált a modern web és cross-platform technológiákhoz képest. Az ökoszisztéma zsugorodik, a fejlesztői szakértelem ritka, és a modern felhős szolgáltatásokkal és API-kkal való integráció kihívást jelent. Nem ajánljuk a Delphi-t új projektekhez, és javasoljuk a meglévő Delphi alkalmazások migrálását modern keretrendszerekre, mint a .NET/C# vagy Angular, amikor lehetséges.</p>"
  },
  {
    "name": "Vue.js",
    "ring": "Hold",
    "quadrant": "Languages & Frameworks",
    "isNew": "FALSE",
    "description": "<p><strong><a href=\"https://vuejs.org/\">Vue.js</a></strong> egy frontend keretrendszer, amelyet a Campus CodeWorks korábban használt, de már nem ajánlott új projektekhez. Bár a Vue.js progresszív megközelítése és könnyű tanulási görbéje vonzó lehet, a Campus CodeWorks standard frontend keretrendszere az Angular, amely jobban illeszkedik a meglévő technológiai stack-hez és csapat szakértelemhez. A Vue.js-t használó meglévő projektek karbantartása továbbra is lehetséges, de új projektekhez az Angular-t ajánljuk a konzisztencia és hosszú távú támogatás érdekében.</p>"
  },
  {
    "name": "Docker",
    "ring": "Assess",
    "quadrant": "Tools",
    "isNew": "TRUE",
    "description": "<p><strong><a href=\"https://www.docker.com/\">Docker</a></strong> elengedhetetlenné vált a Campus CodeWorks alkalmazások konténerizálásához és konzisztens telepítések biztosításához fejlesztési, tesztelési és éles környezetek között. Csapataink a Docker-t használják alkalmazások, integrációk és adminisztratív eszközök csomagolásához. A konténerizáció leegyszerűsíti a függőségek kezelését és lehetővé teszi a szolgáltatások könnyebb skálázását. A Docker Compose különösen hasznos helyi fejlesztési környezetekhez, lehetővé téve a fejlesztők számára, hogy gyorsan elindítsanak összetett alkalmazás stack-eket adatbázisokkal, cache rétegekkel és microservices-szel.</p>"
  },
  {
    "name": "Kubernetes",
    "ring": "Assess",
    "quadrant": "Tools",
    "isNew": "TRUE",
    "description": "<p><strong><a href=\"https://kubernetes.io/\">Kubernetes</a></strong> a Campus CodeWorks által értékelt konténerizált alkalmazások nagy léptékű orchestrálásához. Bár a Kubernetes erős képességeket nyújt összetett microservices architektúrák kezeléséhez, jelentős működési komplexitást vezet be. Csapataink a Kubernetes-t olyan forgatókönyvekhez értékelik, ahol a magas rendelkezésre állás és az automatikus skálázás kritikus, mint például ügyfélportál rendszerek csúcsidőszakokban. Azonban kisebb projektek esetében egyszerűbb konténer orchestration megoldások lehetnek megfelelőbbek.</p>"
  },
  {
    "name": "Jenkins",
    "ring": "Hold",
    "quadrant": "Tools",
    "isNew": "FALSE",
    "description": "<p><strong><a href=\"https://www.jenkins.io/\">Jenkins</a></strong> egykor munkahéj volt a CI/CD pipeline-okhoz a Campus CodeWorks-nál, de látjuk, hogy a csapatok modern alternatívákra migrálnak. Bár a Jenkins nagyon konfigurálható és kiterjedt plugin támogatással rendelkezik, felülete elavultnak tűnik, és a karbantartási terhelés jelentős. Az újabb CI/CD platformok, mint a GitHub Actions és GitLab CI jobb fejlesztői élményt és szorosabb integrációt nyújtanak verziókezelő rendszerekkel. Javasoljuk, hogy az új projekteket indító csapatok értékeljék a modern alternatívákat, bár a meglévő Jenkins telepítések továbbra is szolgálhatják céljukat.</p>"
  },
  {
    "name": "GitHub Actions",
    "ring": "Adopt",
    "quadrant": "Tools",
    "isNew": "FALSE",
    "description": "<p><strong><a href=\"https://github.com/features/actions\">GitHub Actions</a></strong> a Campus CodeWorks preferált CI/CD megoldása GitHub-on tárolt projektekhez. A szoros integráció a GitHub repository-kkal, az egyszerű YAML-alapú konfiguráció és a bőkezű ingyenes szint oktatási intézmények számára kiváló választást jelent. Csapataink a GitHub Actions-t használják automatizált teszteléshez, staging környezetekbe történő telepítéshez és dokumentáció generálásához. A beépített akciók market place-je leegyszerűsíti a gyakori feladatokat, mint a tesztek futtatása, Docker image-ek építése és felhős platformokra történő telepítés.</p>"
  },
  {
    "name": "TFS / Azure DevOps",
    "ring": "Adopt",
    "quadrant": "Tools",
    "isNew": "FALSE",
    "description": "<p><strong><a href=\"https://azure.microsoft.com/en-us/products/devops\">TFS / Azure DevOps</a></strong> a Campus CodeWorks napi használatban lévő verziókezelési és projektmenedzsment platformja. Az Azure DevOps integrált megoldást nyújt verziókezeléshez, build és release folyamatokhoz, work item követéshez és teszteléshez. Csapataink naponta használják a TFS/Azure DevOps-t kód tárolásához, CI/CD pipeline-ok kezeléséhez és projekt követéséhez. A platform átfogó eszközkészlete lehetővé teszi a teljes fejlesztési életciklus kezelését egy helyen, javítva a csapatok közötti együttműködést és a projekt láthatóságát.</p>"
  },
  {
    "name": "Confluence",
    "ring": "Adopt",
    "quadrant": "Tools",
    "isNew": "FALSE",
    "description": "<p><strong><a href=\"https://www.atlassian.com/software/confluence\">Confluence</a></strong> a Campus CodeWorks napi használatban lévő dokumentációs és tudásmenedzsment platformja. A Confluence lehetővé teszi a csapatok számára, hogy központilag tárolják, szervezzék és osszák meg dokumentációjukat, technikai specifikációikat és projekt információikat. Csapataink naponta használják a Confluence-t dokumentáció írásához, meeting jegyzőkönyvek tárolásához, technikai leírások karbantartásához és tudásbázis építéséhez. A platform keresési funkciói és strukturált oldalai segítik a gyors információ elérést és a tudás megosztását a szervezetben.</p>"
  },
  {
    "name": "PostgreSQL",
    "ring": "Assess",
    "quadrant": "Platforms",
    "isNew": "TRUE",
    "description": "<p><strong><a href=\"https://www.postgresql.org/\">PostgreSQL</a></strong> a Campus CodeWorks standard relációs adatbázisa, amelyet megbízhatósága, funkció gazdagsága és nyílt forráskódú természete miatt választottunk. A PostgreSQL fejlett funkciói, mint a JSON támogatás, teljes szöveges keresés és robusztus tranzakció kezelés, alkalmasvá teszik különböző használati esetekhez. Az adatbázis erős ACID megfelelősége és adatintegritási funkciói kritikusak olyan alkalmazásokhoz, amelyek érzékeny adatokat kezelnek. A PostgreSQL aktív közössége és átfogó dokumentációja hatékonyan támogatja fejlesztői csapatainkat.</p>"
  },
  {
    "name": "MongoDB",
    "ring": "Assess",
    "quadrant": "Platforms",
    "isNew": "TRUE",
    "description": "<p><strong><a href=\"https://www.mongodb.com/\">MongoDB</a></strong> a Campus CodeWorks által értékelt adatbázis rugalmas sémájú alkalmazásokhoz, mint például tartalomkezelő rendszerek és analitikai platformok. A MongoDB dokumentum modellje olyan forgatókönyvekhez illeszkedik, ahol az adatstruktúrák gyakran változnak, ami gyakori az oktatási technológiai projektekben. Azonban csapataink óvatosak a MongoDB használatával olyan alkalmazásokhoz, amelyek összetett tranzakciókat vagy szigorú adatkonzisztenciát igényelnek. A MongoDB-t specifikus használati esetekhez ajánljuk, mint például kurzus tartalmak, portfóliók és eseményadatok tárolása, ahol a séma rugalmassága egyértelmű előnyöket nyújt.</p>"
  },
  {
    "name": "Redis",
    "ring": "Assess",
    "quadrant": "Platforms",
    "isNew": "TRUE",
    "description": "<p><strong><a href=\"https://redis.io/\">Redis</a></strong> a Campus CodeWorks standard cache és session tárolási megoldása webalkalmazásokhoz. A Redis jelentősen javítja a teljesítményt nagy forgalmú rendszereknél. Csapataink a Redis-t használják gyakran elérhető adatok cache-eléséhez, felhasználói session-ök kezeléséhez és rate limiting implementálásához. A Redis pub/sub képességei lehetővé teszik valós idejű funkciókat, mint élő értesítések és chat rendszerek. A memóriában tárolt adatbázis sebessége és egyszerűsége elengedhetetlen komponenssé teszi a Campus CodeWorks alkalmazás architektúrájában.</p>"
  },
  {
    "name": "RabbitMQ",
    "ring": "Adopt",
    "quadrant": "Platforms",
    "isNew": "TRUE",
    "description": "<p><strong><a href=\"https://www.rabbitmq.com/\">RabbitMQ</a></strong> a Campus CodeWorks standard message broker-je eseményvezérelt és microservices-alapú rendszerekhez, beleértve a KAV vizsgaszervező rendszert. A RabbitMQ megbízható, aszinkron kommunikációt tesz lehetővé szolgáltatások között queue-k és topic-ok révén, javítva a decoupling-ot és a rugalmasságot. Csapataink a RabbitMQ-t használják domain eseményekhez, integrációs eseményekhez és háttérfeldolgozási munkaterhelésekhez. A RabbitMQ érett ökoszisztémája és bevált stabilitása alapvető komponenssé teszi backend platformunkban.</p>"
  },
  {
    "name": "MinIO",
    "ring": "Trial",
    "quadrant": "Platforms",
    "isNew": "TRUE",
    "description": "<p><strong><a href=\"https://min.io/\">MinIO</a></strong> is being trialed by Campus CodeWorks as a self-hosted, S3-compatible object storage platform, elsősorban olyan rendszerekben, mint a KAV vizsgaszervező megoldás. MinIO biztosítja a dokumentumok, tanúsítványok és archivált fájlok tartós, nagy rendelkezésre állású tárolását Kubernetes környezetben. A megoldás jól illeszkedik a konténeres és on-premise infrastruktúrához, de hosszú távon össze kell vetni felhős alternatívákkal (pl. S3) üzemeltetési és költség szempontból.</p>"
  },
  {
    "name": "AWS",
    "ring": "Adopt",
    "quadrant": "Platforms",
    "isNew": "TRUE",
    "description": "<p><strong><a href=\"https://aws.amazon.com/\">Amazon Web Services (AWS)</a></strong> a Campus CodeWorks elsődleges felhő platformja alkalmazások és szolgáltatások üzemeltetéséhez. Az AWS oktatási kedvezmény programja és átfogó szolgáltatás kínálata kiváló választást jelent minden méretű intézmény számára. Csapataink az AWS szolgáltatásait használják, mint az EC2 számítási feladatokhoz, RDS kezelt adatbázisokhoz, S3 tároláshoz és CloudFront tartalomkézbesítéshez. Az AWS megfelelőségi tanúsítványai és biztonsági funkciói elengedhetetlenek az oktatási adatok kezeléséhez. A platform skálázhatósága támogatja a csúcs terheléseket regisztrációs időszakokban és félév kezdetekor.</p>"
  },
  {
    "name": "Microservices architecture",
    "ring": "Assess",
    "quadrant": "Techniques",
    "isNew": "TRUE",
    "description": "<p><strong>Microservices architektúra</strong> a Campus CodeWorks által értékelt megközelítés nagy, monolitikus rendszerek kisebb, függetlenül telepíthető szolgáltatásokra bontásához. Ez a megközelítés javíthatja a fejlesztési sebességet és lehetővé teszi, hogy különböző csapatok külön szolgáltatásokon dolgozzanak. Azonban csapataink tapasztalata szerint a microservices jelentős működési komplexitást vezet be, beleértve a service discovery-t, elosztott tracing-et és adatkonzisztencia kihívásokat. A microservices-t csak érett DevOps gyakorlattal rendelkező projektekhez ajánljuk, ahol egyértelmű határok vannak a rendszer domain-ek között. Kisebb projektekhez egy jól strukturált monolith megfelelőbb lehet.</p>"
  },
  {
    "name": "API-first design",
    "ring": "Adopt",
    "quadrant": "Techniques",
    "isNew": "FALSE",
    "description": "<p><strong>API-first design</strong> standard gyakorlattá vált a Campus CodeWorks fejlesztői csapatai számára. Az API-k felhasználói felületek építése előtti tervezésével a csapatok konzisztens adatelérési mintákat biztosíthatnak web, mobil és harmadik fél integrációk között. Ez a megközelítés különösen értékes olyan rendszerekhez, ahol az adatoknak több csatornáról kell elérhetőnek lenniük, beleértve ügyfélportálokat, mobilalkalmazásokat és adminisztratív eszközöket. Az API-first design jobb szeparációt tesz lehetővé és megkönnyíti az integrációt más platformokkal.</p>"
  },
  {
    "name": "Infrastructure as Code",
    "ring": "Assess",
    "quadrant": "Techniques",
    "isNew": "TRUE",
    "description": "<p><strong>Infrastructure as Code (IaC)</strong> olyan eszközökkel, mint a Terraform és CloudFormation, átalakította, ahogy a Campus CodeWorks kezeli a felhő erőforrásokat. Az IaC lehetővé teszi verziókezelt infrastruktúrát, megismételhető telepítéseket és könnyebb katasztrófa helyreállítást. Csapataink az IaC-t használják adatbázisok, számítási példányok és hálózati erőforrások kiépítéséhez Campus CodeWorks alkalmazásokhoz. Ez a megközelítés csökkenti a manuális konfigurációs hibákat és lehetővé teszi a gyorsabb helyreállítást infrastruktúra hibákból. Az IaC különösen értékes több környezetes beállításokhoz, ahol a fejlesztési, staging és éles környezeteknek konzisztensnek kell lenniük.</p>"
  },
  {
    "name": "Continuous Integration/Continuous Deployment",
    "ring": "Adopt",
    "quadrant": "Techniques",
    "isNew": "FALSE",
    "description": "<p><strong>Continuous Integration/Continuous Deployment (CI/CD)</strong> pipeline-ok standard gyakorlattá váltak a Campus CodeWorks fejlesztői csapatai számára. Az automatizált tesztelés és telepítés csökkenti a hibák bevezetésének kockázatát éles rendszerekbe. A CI/CD lehetővé teszi a funkciók és javítások gyorsabb szállítását, ami kritikus a változó követelményekre való reagáláshoz. Csapataink a CI/CD-t használják automatikus tesztek futtatásához, biztonsági szkennelésekhez és staging környezetekbe történő telepítéshez, mielőtt manuálisan élesbe kerülnének.</p>"
  },
  {
    "name": "Event-driven architecture",
    "ring": "Assess",
    "quadrant": "Techniques",
    "isNew": "TRUE",
    "description": "<p><strong>Eseményvezérelt architektúra</strong> a Campus CodeWorks által értékelt megközelítés különböző rendszerek integrálásához, amelyeknek valós időben kell reagálniuk változásokra. Például, amikor egy felhasználó regisztrál egy szolgáltatásra, több rendszert is értesíteni kell. Az eseményvezérelt minták message queue-k vagy esemény stream-ek használatával decouple-olhatják ezeket a rendszereket és javíthatják a rugalmasságot. Azonban az eseményvezérelt architektúra implementálása körültekintő tervezést igényel az esemény sorrend kezeléséhez, idempotenciához és hibakezeléshez. Ezt a mintát specifikus integrációs forgatókönyvekhez értékeljük, ahol a laza csatolás egyértelmű előnyöket nyújt.</p>"
  },
  {
    "name": "Single Sign-On (SSO)",
    "ring": "Adopt",
    "quadrant": "Techniques",
    "isNew": "FALSE",
    "description": "<p><strong>Single Sign-On (SSO)</strong> olyan protokollokkal, mint a SAML és OAuth, elengedhetetlen a zökkenőmentes hozzáférés biztosításához Campus CodeWorks alkalmazásokhoz. Az SSO javítja a felhasználói élményt azáltal, hogy megszünteti a több jelszó megjegyzésének szükségességét, miközben javítja a biztonságot központosított autentikációval. A Campus CodeWorks az SSO-t használja különböző rendszerek integrálásához, ügyfélportálokhoz és adminisztratív eszközökhöz. Az SSO jobb hozzáférés-vezérlést és audit nyomvonalakat is lehetővé tesz, ami kritikus a megfelelőségi követelményekhez.</p>"
  },
  {
    "name": "Data warehousing for analytics",
    "ring": "Assess",
    "quadrant": "Techniques",
    "isNew": "TRUE",
    "description": "<p><strong>Adatraktározás analitikához</strong> lehetővé teszi a Campus CodeWorks számára, hogy betekintést nyerjen működési adatokból különböző rendszerekből. Több forrásból származó adatok adatraktárba történő konszolidálásával analitikai csapataink kutatásokat végezhetnek, metrikákat követhetnek és jelentéseket generálhatnak. Az adatraktározás olyan használati eseteket támogat, mint a kockázatos felhasználók azonosítása, teljesítési arányok elemzése és erőforrás allokáció optimalizálása. ETL folyamatokat használunk a működési rendszerek rendszeres szinkronizálásához az adatraktárral, miközben fenntartjuk az adatvédelmet és biztonságot.</p>"
  },
  {
    "name": "Mobile-first design",
    "ring": "Adopt",
    "quadrant": "Techniques",
    "isNew": "FALSE",
    "description": "<p><strong>Mobile-first design</strong> elengedhetetlen a Campus CodeWorks alkalmazásokhoz, mivel a felhasználók egyre gyakrabban okostelefonokról és tabletekről érik el a szolgáltatásokat. Csapataink prioritást adnak a mobil élményeknek regisztrációkhoz, térképekhez, esemény naptárakhoz és ügyfélportálokhoz. A mobile-first design biztosítja, hogy a kritikus funkcionalitás elérhető legyen kis képernyőkön és érintőfelületeken. A reszponzív web design és progresszív webalkalmazás (PWA) technikák lehetővé teszik app-szerű élmények nyújtását natív alkalmazás fejlesztés nélkül minden platformhoz. A mobile-first gondolkodás standard gyakorlattá vált minden új Campus CodeWorks alkalmazás projekthez.</p>"
  },
  {
    "name": "Container orchestration",
    "ring": "Assess",
    "quadrant": "Techniques",
    "isNew": "TRUE",
    "description": "<p><strong>Konténer orchestration</strong> olyan platformokkal, mint a Kubernetes, a Campus CodeWorks által értékelt megközelítés összetett alkalmazás telepítések kezeléséhez. A konténer orchestration lehetővé teszi az automatikus skálázást, öngyógyítást és rolling update-eket, ami értékes magas rendelkezésre állású rendszerekhez. Azonban az orchestration platformok jelentős működési komplexitást vezetnek be és szakértelmet igényelnek. Csapataink értékelik, hogy az előnyök megérnék-e a tanulási görbét és karbantartási terhelést. Kisebb projektek esetében egyszerűbb telepítési stratégiák lehetnek megfelelőbbek, míg nagyobb projektek dedikált DevOps csapatokkal előnyöket nyerhetnek az orchestration képességekből.</p>"
  },
  {
    "name": "Serverless architecture",
    "ring": "Assess",
    "quadrant": "Techniques",
    "isNew": "TRUE",
    "description": "<p><strong>Serverless architektúra</strong> olyan platformokkal, mint az AWS Lambda és Azure Functions, a Campus CodeWorks által értékelt megközelítés specifikus használati esetekhez. A serverless csökkentheti a működési terhelést szerver kezelés megszüntetésével és automatikus skálázás engedélyezésével. Csapataink a serverless-t értékelik eseményvezérelt integrációkhoz, ütemezett feladatokhoz, mint adatszinkronizáció, és változó forgalmi mintákkal rendelkező API végpontokhoz. Azonban a serverless kihívásokat vezet be cold start-ok, debugging és vendor lock-in terén. A serverless-t specifikus forgatókönyvekhez értékeljük, ahol az előnyök felülmúlják a kompromisszumokat, nem pedig teljes körű helyettesítésként a hagyományos szerver-alapú architektúrák helyett.</p>"
  },
  {
    "name": "Observability and monitoring",
    "ring": "Adopt",
    "quadrant": "Techniques",
    "isNew": "FALSE",
    "description": "<p><strong>Megfigyelhetőség és monitoring</strong> olyan eszközökkel, mint a Prometheus, Grafana és alkalmazás teljesítmény monitoring (APM) megoldások, elengedhetetlen a megbízható Campus CodeWorks szolgáltatások fenntartásához. Összetettebb rendszerekben, mint a KAV vizsgaszervező platform, ezt kiegészítjük EFK stackkel (Elasticsearch, Fluentd/Fluent Bit, Kibana) a központosított logoláshoz és OpenTelemetry alapú tracinggel (Jaeger/Tempo). Az átfogó monitoring lehetővé teszi csapataink számára, hogy problémákat észleljenek, mielőtt azok hatással lennének a felhasználókra, megértsék a rendszer teljesítményét csúcsidőszakokban és gyorsan elhárítsák a problémákat. Többszintű monitoringot implementálunk: infrastruktúra metrikák, alkalmazás teljesítmény és üzleti metrikák. A hatékony megfigyelhetőség kritikus a szolgáltatási szintű megállapodások fenntartásához és pozitív felhasználói élmények biztosításához.</p>"
  },
  {
    "name": "MSSQL",
    "ring": "Adopt",
    "quadrant": "Platforms",
    "isNew": "TRUE",
    "description": "<p><strong><a href=\"https://www.microsoft.com/sql-server\">Microsoft SQL Server (MSSQL)</a></strong> a Campus CodeWorks által használatban lévő relációs adatbázis-kezelő rendszer. Csapataink az MSSQL-t használják vállalati alkalmazásokhoz, ahol a Windows ökoszisztéma és a .NET integráció elsődleges. Az MSSQL erős tranzakciókezelése, biztonsági funkciói és az Azure SQL integráció lehetősége megbízható választást nyújt kritikus üzleti adatok tárolásához.</p>"
  },
  {
    "name": "Oracle",
    "ring": "Adopt",
    "quadrant": "Platforms",
    "isNew": "TRUE",
    "description": "<p><strong><a href=\"https://www.oracle.com/database/\">Oracle Database</a></strong> a Campus CodeWorks által használatban lévő relációs adatbázis rendszer. Az Oracle-t olyan projektekben és ügyfelekkel használjuk, ahol már meglévő Oracle infrastruktúra vagy licenszelési megállapodások vannak. Az Oracle erős adatintegritási és skálázhatósági képességei megfelelnek nagyvállalati igényeknek.</p>"
  },
  {
    "name": "ELK Stack",
    "ring": "Adopt",
    "quadrant": "Platforms",
    "isNew": "TRUE",
    "description": "<p><strong><a href=\"https://www.elastic.co/elasticstack\">ELK Stack</a></strong> (Elasticsearch, Logstash, Kibana) a Campus CodeWorks által használatban lévő központosított loggyűjtési, keresési és vizualizációs platform. Csapataink az ELK stacket használják alkalmazás- és infrastruktúra logok összegyűjtéséhez, kereséséhez és dashboardok készítéséhez. A stack kiegészíti a megfigyelhetőségi stratégiát a részletes log elemzés és hibakeresés támogatásával.</p>"
  },
  {
    "name": "ChatGPT",
    "ring": "Adopt",
    "quadrant": "Tools",
    "isNew": "TRUE",
    "description": "<p><strong><a href=\"https://chat.openai.com/\">ChatGPT</a></strong> a Campus CodeWorks által használatban lévő AI-alapú asszisztens dokumentációhoz, kód példákhoz, és általános fejlesztési kérdésekhez. Csapataink a ChatGPT-t használják gyors információkeresésre, sablonok és dokumentumok piszkozatolására, valamint ötletgyűjtésre. A tool segíti a produktivitást, miközben a szervezeti adatkezelési irányelvek betartása mellett használjuk.</p>"
  },
  {
    "name": "Cursor AI",
    "ring": "Trial",
    "quadrant": "Tools",
    "isNew": "TRUE",
    "description": "<p><strong><a href=\"https://cursor.com/\">Cursor AI</a></strong> jelenleg nem használatban a Campus CodeWorks-nál, de bevezetését érdemes megfontolni. A Cursor AI-alapú kódszerkesztő, amely kontextusérzékeny javaslatokat és kódgenerálást nyújt a fejlesztők számára. A bevezetés előtt érdemes kipróbálni a biztonsági és adatkezelési szabályzatokkal való összeegyeztethetőségét.</p>"
  },
  {
    "name": "Claude Code",
    "ring": "Assess",
    "quadrant": "Tools",
    "isNew": "TRUE",
    "description": "<p><strong><a href=\"https://claude.ai/\">Claude (Claude Code)</a></strong> jelenleg nem használatban a Campus CodeWorks-nál; megvizsgálásra javasolt. Az Anthropic által készített AI asszisztens kódértelmezést, dokumentációt és fejlesztési támogatást nyújt. Értékelni kell a szervezeti igényekhez való illeszkedést, licenszelést és a meglévő AI eszközök (pl. ChatGPT) melletti használatot.</p>"
  },
  {
    "name": "Proxmox VE",
    "ring": "Assess",
    "quadrant": "Platforms",
    "isNew": "TRUE",
    "description": "<p><strong><a href=\"https://www.proxmox.com/\">Proxmox VE</a></strong> jelenleg nem használatban; a virtualizáció bővítése érdekében megvizsgálásra javasolt. A Proxmox nyílt forráskódú, KVM- és LXC-alapú virtualizációs platform, amely on-premise szerverek és VMs kezelését teszi lehetővé. Értékelni kell a meglévő infrastruktúrával való összeegyeztethetőséget és üzemeltetési költségeket.</p>"
  },
  {
    "name": "VMware ESXi",
    "ring": "Assess",
    "quadrant": "Platforms",
    "isNew": "TRUE",
    "description": "<p><strong><a href=\"https://www.vmware.com/products/esxi-and-esx.html\">VMware ESXi</a></strong> jelenleg nem használatban; a virtualizáció bevezetése vagy bővítése érdekében megvizsgálásra javasolt. Az ESXi iparági standard hypervisor nagy rendelkezésre állású, skálázható virtuális környezetekhez. Értékelni kell a licenszelési költségeket a Proxmox és egyéb alternatívákhoz képest, valamint a szervezet virtualizációs stratégiájához való illeszkedést.</p>"
  }
]
