[
  
  {
    "name": "Udemy for Education",
    "ring": "Adopt",
    "quadrant": "Platforms",
    "isNew": "TRUE",
    "description": "<p><strong><a href=\"https://business.udemy.com/udemy-for-business/\">Udemy for Education</a></strong> is the online learning and professional development platform used by Campus CodeWorks. Udemy provides access to a large course library covering technical skills, programming languages and professional development topics. Our teams use Udemy for employee training, skill development and keeping up with technology trends. The platform's structured learning paths, video-based content and progress-tracking features make both individual learning and team-wide upskilling effective. Udemy's integration options and reporting support Campus CodeWorks in tracking learning progress and ensuring continuous professional development across the organisation.</p>"
  },
  {
    "name": "Angular",
    "ring": "Adopt",
    "quadrant": "Languages & Frameworks",
    "isNew": "FALSE",
    "description": "<p><strong><a href=\"https://angular.io/\">Angular</a></strong> is Campus CodeWorks' standard choice for building modern web applications and client portals. Our development teams use Angular in key projects, including the Neptun, KVAR and e-Titán systems. Angular's comprehensive framework with built-in routing, forms, HTTP client and dependency injection accelerates development of complex enterprise applications. Its structured approach and TypeScript-first philosophy ensure consistency across teams and projects. Angular's strong tooling, testing capabilities and enterprise-grade architecture make it ideal for large-scale applications requiring maintainability and long-term support.</p>"
  },
  {
    "name": "Telerik Kendo UI",
    "ring": "Adopt",
    "quadrant": "Languages & Frameworks",
    "isNew": "FALSE",
    "description": "<p><strong><a href=\"https://www.telerik.com/kendo-ui\">Telerik Kendo UI</a></strong> is the UI component library in use at Campus CodeWorks. Kendo UI provides a comprehensive set of components for building modern web applications, including data grids, form controls, calendars, charts and other interactive UI elements. Our teams use Kendo UI to build consistent, professional user interfaces that enable rapid development and easy maintainability. The library's strong Angular integration and TypeScript support align well with the Campus CodeWorks technology stack. Kendo UI's extensive documentation and support help developers implement UI components effectively.</p>"
  },
  {
    "name": "TypeScript",
    "ring": "Adopt",
    "quadrant": "Languages & Frameworks",
    "isNew": "FALSE",
    "description": "<p><strong><a href=\"https://www.typescriptlang.org/\">TypeScript</a></strong> is highly valuable for Campus CodeWorks development teams working on large-scale applications. The type safety it provides reduces bugs and improves code maintainability, which is critical for systems where data accuracy is paramount. TypeScript's excellent IDE support and incremental adoption path allow teams to migrate existing JavaScript codebases step by step. We recommend TypeScript for every new Campus CodeWorks web application project.</p>"
  },
  {
    "name": "C#",
    "ring": "Adopt",
    "quadrant": "Languages & Frameworks",
    "isNew": "FALSE",
    "description": "<p><strong><a href=\"https://dotnet.microsoft.com/en-us/languages/csharp\">C#</a></strong> is Campus CodeWorks' primary backend development language for all projects. C# together with the .NET platform provides a robust, type-safe and performant foundation for enterprise applications, microservices and APIs. Our teams leverage C#'s strong type system, excellent tooling and comprehensive standard library to build reliable backend services. The language's integration with the .NET ecosystem—including ASP.NET Core, Entity Framework and modern async/await patterns—makes it ideal for building scalable backend systems. We use C# across the full Campus CodeWorks backend infrastructure, ensuring consistency and maintainability across projects.</p>"
  },
  {
    "name": ".NET 10",
    "ring": "Adopt",
    "quadrant": "Languages & Frameworks",
    "isNew": "FALSE",
    "description": "<p><strong><a href=\"https://dotnet.microsoft.com/\">.NET 10</a></strong> is the .NET platform version used by Campus CodeWorks in its products. .NET 10 delivers improved performance, better memory management and new features that enhance application efficiency and scalability. Our teams use .NET 10 for backend services, APIs and microservices. The platform provides modern development patterns, strong tooling support and comprehensive libraries that support writing efficient and maintainable code. .NET 10's long-term support and stability are critical for Campus CodeWorks products.</p>"
  },
  {
    "name": "Kotlin",
    "ring": "Adopt",
    "quadrant": "Languages & Frameworks",
    "isNew": "FALSE",
    "description": "<p><strong><a href=\"https://kotlinlang.org/\">Kotlin</a></strong> is Campus CodeWorks' standard language for mobile application development, especially on Android. Kotlin's modern syntax, null-safety support and interoperability with Java make it an excellent choice for mobile development. Our mobile development teams use Kotlin to build native Android applications with improved code readability and less boilerplate than Java. Kotlin's coroutines support enables efficient asynchronous programming, which is essential for mobile apps that handle network requests and background work. The language's strong tooling and growing ecosystem make it our primary choice for mobile development projects.</p>"
  },
  {
    "name": "Rust",
    "ring": "Assess",
    "quadrant": "Languages & Frameworks",
    "isNew": "TRUE",
    "description": "<p><strong><a href=\"https://www.rust-lang.org/\">Rust</a></strong> is receiving increasing attention in Campus CodeWorks technology discussions, especially for performance-critical systems and security-sensitive applications. Although Rust's memory-safety guarantees are attractive for systems handling sensitive data, the learning curve is steep compared to languages our teams already know. We evaluate Rust for specific use cases such as high-performance data pipelines and security-critical microservices, but it is not yet ready for broad adoption in our development workflows.</p>"
  },
  {
    "name": "Go",
    "ring": "Assess",
    "quadrant": "Languages & Frameworks",
    "isNew": "TRUE",
    "description": "<p><strong><a href=\"https://go.dev/\">Go</a></strong> is a potential language under evaluation by Campus CodeWorks for backend services, microservices and cloud-native applications. Go's simplicity, fast compilation, strong concurrency support with goroutines and solid standard library make it attractive for building scalable backend systems. The language's performance characteristics and built-in tooling for testing and profiling are appealing for high-throughput services. However, our teams currently have strong expertise in C# and .NET, so we are assessing whether Go's benefits would justify the learning curve and ecosystem shift. We evaluate Go for specific use cases such as microservices, API gateways and CLI tools where its strengths offer clear advantages.</p>"
  },
  {
    "name": "Delphi",
    "ring": "Hold",
    "quadrant": "Languages & Frameworks",
    "isNew": "FALSE",
    "description": "<p><strong><a href=\"https://www.embarcadero.com/products/delphi\">Delphi</a></strong> is a legacy programming language and IDE still used by Campus CodeWorks in some existing projects, especially desktop applications and older client systems. Although Delphi was once a popular choice for Windows desktop development, it has become outdated compared to modern web and cross-platform technologies. The ecosystem is shrinking, developer expertise is scarce, and integration with modern cloud services and APIs is challenging. We do not recommend Delphi for new projects and advise migrating existing Delphi applications to modern frameworks such as .NET/C# or Angular where possible.</p>"
  },
  {
    "name": "Vue.js",
    "ring": "Hold",
    "quadrant": "Languages & Frameworks",
    "isNew": "FALSE",
    "description": "<p><strong><a href=\"https://vuejs.org/\">Vue.js</a></strong> is a frontend framework previously used by Campus CodeWorks but no longer recommended for new projects. Although Vue.js's progressive approach and gentle learning curve can be appealing, Campus CodeWorks' standard frontend framework is Angular, which fits better with our existing technology stack and team expertise. Maintaining existing projects that use Vue.js remains possible, but we recommend Angular for new projects for consistency and long-term support.</p>"
  },
  {
    "name": "Docker",
    "ring": "Assess",
    "quadrant": "Tools",
    "isNew": "TRUE",
    "description": "<p><strong><a href=\"https://www.docker.com/\">Docker</a></strong> has become essential for containerising Campus CodeWorks applications and ensuring consistent deployments across development, test and production environments. Our teams use Docker to package applications, integrations and administrative tools. Containerisation simplifies dependency management and makes it easier to scale services. Docker Compose is especially useful for local development environments, allowing developers to spin up complex application stacks with databases, cache layers and microservices quickly.</p>"
  },
  {
    "name": "Kubernetes",
    "ring": "Assess",
    "quadrant": "Tools",
    "isNew": "TRUE",
    "description": "<p><strong><a href=\"https://kubernetes.io/\">Kubernetes</a></strong> is under evaluation by Campus CodeWorks for large-scale orchestration of containerised applications. Although Kubernetes offers strong capabilities for managing complex microservices architectures, it introduces significant operational complexity. Our teams evaluate Kubernetes for scenarios where high availability and automatic scaling are critical, such as client portal systems during peak periods. For smaller projects, simpler container orchestration solutions may be more appropriate.</p>"
  },
  {
    "name": "Jenkins",
    "ring": "Hold",
    "quadrant": "Tools",
    "isNew": "FALSE",
    "description": "<p><strong><a href=\"https://www.jenkins.io/\">Jenkins</a></strong> was once the workhorse for CI/CD pipelines at Campus CodeWorks, but we see teams migrating to modern alternatives. Although Jenkins is highly configurable and has extensive plugin support, its interface feels dated and the maintenance burden is significant. Newer CI/CD platforms such as GitHub Actions and GitLab CI offer a better developer experience and tighter integration with version control. We recommend that teams starting new projects evaluate modern alternatives, although existing Jenkins installations can continue to serve their purpose.</p>"
  },
  {
    "name": "GitHub Actions",
    "ring": "Adopt",
    "quadrant": "Tools",
    "isNew": "FALSE",
    "description": "<p><strong><a href=\"https://github.com/features/actions\">GitHub Actions</a></strong> is Campus CodeWorks' preferred CI/CD solution for projects hosted on GitHub. Tight integration with GitHub repositories, simple YAML-based configuration and a generous free tier for educational institutions make it an excellent choice. Our teams use GitHub Actions for automated testing, deployment to staging environments and documentation generation. The built-in Actions marketplace simplifies common tasks such as running tests, building Docker images and deploying to cloud platforms.</p>"
  },
  {
    "name": "TFS / Azure DevOps",
    "ring": "Adopt",
    "quadrant": "Tools",
    "isNew": "FALSE",
    "description": "<p><strong><a href=\"https://azure.microsoft.com/en-us/products/devops\">TFS / Azure DevOps</a></strong> is the version control and project management platform in daily use at Campus CodeWorks. Azure DevOps provides an integrated solution for version control, build and release pipelines, work item tracking and testing. Our teams use TFS/Azure DevOps daily for code storage, CI/CD pipeline management and project tracking. The platform's comprehensive toolset enables managing the full development lifecycle in one place, improving collaboration and project visibility.</p>"
  },
  {
    "name": "Confluence",
    "ring": "Adopt",
    "quadrant": "Tools",
    "isNew": "FALSE",
    "description": "<p><strong><a href=\"https://www.atlassian.com/software/confluence\">Confluence</a></strong> is the documentation and knowledge management platform in daily use at Campus CodeWorks. Confluence enables teams to store, organise and share documentation, technical specifications and project information centrally. Our teams use Confluence daily for writing documentation, storing meeting notes, maintaining technical descriptions and building knowledge bases. The platform's search and structured pages support quick access to information and knowledge sharing across the organisation.</p>"
  },
  {
    "name": "PostgreSQL",
    "ring": "Trial",
    "quadrant": "Platforms",
    "isNew": "TRUE",
    "description": "<p><strong><a href=\"https://www.postgresql.org/\">PostgreSQL</a></strong> is being trialed by Campus CodeWorks as the standard relational database, chosen for its reliability, feature richness and open-source nature. PostgreSQL's advanced features—including JSON support, full-text search and robust transaction handling—make it suitable for diverse use cases. The database's strong ACID compliance and data integrity features are critical for applications handling sensitive data. Its active community and comprehensive documentation effectively support our development teams.</p>"
  },
  {
    "name": "MongoDB",
    "ring": "Assess",
    "quadrant": "Platforms",
    "isNew": "TRUE",
    "description": "<p><strong><a href=\"https://www.mongodb.com/\">MongoDB</a></strong> is evaluated by Campus CodeWorks as a database for flexible-schema applications such as content management systems and analytics platforms. MongoDB's document model fits scenarios where data structures change frequently, which is common in educational technology projects. However, our teams are cautious about using MongoDB for applications that require complex transactions or strict data consistency. We recommend MongoDB for specific use cases such as storing course content, portfolios and event data where schema flexibility offers clear benefits.</p>"
  },
  {
    "name": "Redis",
    "ring": "Trial",
    "quadrant": "Platforms",
    "isNew": "TRUE",
    "description": "<p><strong><a href=\"https://redis.io/\">Redis</a></strong> is being trialed by Campus CodeWorks as the standard cache and session store for web applications. Redis significantly improves performance in high-traffic systems. Our teams use Redis for caching frequently accessed data, managing user sessions and implementing rate limiting. Redis pub/sub capabilities enable real-time features such as live notifications and chat systems. The in-memory database's speed and simplicity make it an essential component in the Campus CodeWorks application architecture.</p>"
  },
  {
    "name": "RabbitMQ",
    "ring": "Adopt",
    "quadrant": "Platforms",
    "isNew": "TRUE",
    "description": "<p><strong><a href=\"https://www.rabbitmq.com/\">RabbitMQ</a></strong> is Campus CodeWorks' standard message broker for event-driven and microservices-based systems, including the KAV exam orchestration system. RabbitMQ enables reliable, asynchronous communication between services via queues and topics, improving decoupling and flexibility. Our teams use RabbitMQ for domain events, integration events and background processing workloads. RabbitMQ's mature ecosystem and proven stability make it a core component of our backend platform.</p>"
  },
  {
    "name": "MinIO",
    "ring": "Trial",
    "quadrant": "Platforms",
    "isNew": "TRUE",
    "description": "<p><strong><a href=\"https://min.io/\">MinIO</a></strong> is being trialed by Campus CodeWorks as a self-hosted, S3-compatible object storage platform, elsősorban olyan rendszerekben, mint a KAV vizsgaszervező megoldás. MinIO biztosítja a dokumentumok, tanúsítványok és archivált fájlok tartós, nagy rendelkezésre állású tárolását Kubernetes környezetben. A megoldás jól illeszkedik a konténeres és on-premise infrastruktúrához, de hosszú távon össze kell vetni felhős alternatívákkal (pl. S3) üzemeltetési és költség szempontból.</p>"
  },
  {
    "name": "AWS",
    "ring": "Adopt",
    "quadrant": "Platforms",
    "isNew": "TRUE",
    "description": "<p><strong><a href=\"https://aws.amazon.com/\">Amazon Web Services (AWS)</a></strong> a Campus CodeWorks elsődleges felhő platformja alkalmazások és szolgáltatások üzemeltetéséhez. Az AWS oktatási kedvezmény programja és átfogó szolgáltatás kínálata kiváló választást jelent minden méretű intézmény számára. Csapataink az AWS szolgáltatásait használják, mint az EC2 számítási feladatokhoz, RDS kezelt adatbázisokhoz, S3 tároláshoz és CloudFront tartalomkézbesítéshez. Az AWS megfelelőségi tanúsítványai és biztonsági funkciói elengedhetetlenek az oktatási adatok kezeléséhez. A platform skálázhatósága támogatja a csúcs terheléseket regisztrációs időszakokban és félév kezdetekor.</p>"
  },
  {
    "name": "Microservices architecture",
    "ring": "Assess",
    "quadrant": "Techniques",
    "isNew": "TRUE",
    "description": "<p><strong>Microservices architektúra</strong> a Campus CodeWorks által értékelt megközelítés nagy, monolitikus rendszerek kisebb, függetlenül telepíthető szolgáltatásokra bontásához. Ez a megközelítés javíthatja a fejlesztési sebességet és lehetővé teszi, hogy különböző csapatok külön szolgáltatásokon dolgozzanak. Azonban csapataink tapasztalata szerint a microservices jelentős működési komplexitást vezet be, beleértve a service discovery-t, elosztott tracing-et és adatkonzisztencia kihívásokat. A microservices-t csak érett DevOps gyakorlattal rendelkező projektekhez ajánljuk, ahol egyértelmű határok vannak a rendszer domain-ek között. Kisebb projektekhez egy jól strukturált monolith megfelelőbb lehet.</p>"
  },
  {
    "name": "API-first design",
    "ring": "Adopt",
    "quadrant": "Techniques",
    "isNew": "FALSE",
    "description": "<p><strong>API-first design</strong> standard gyakorlattá vált a Campus CodeWorks fejlesztői csapatai számára. Az API-k felhasználói felületek építése előtti tervezésével a csapatok konzisztens adatelérési mintákat biztosíthatnak web, mobil és harmadik fél integrációk között. Ez a megközelítés különösen értékes olyan rendszerekhez, ahol az adatoknak több csatornáról kell elérhetőnek lenniük, beleértve ügyfélportálokat, mobilalkalmazásokat és adminisztratív eszközöket. Az API-first design jobb szeparációt tesz lehetővé és megkönnyíti az integrációt más platformokkal.</p>"
  },
  {
    "name": "Infrastructure as Code",
    "ring": "Assess",
    "quadrant": "Techniques",
    "isNew": "TRUE",
    "description": "<p><strong>Infrastructure as Code (IaC)</strong> olyan eszközökkel, mint a Terraform és CloudFormation, átalakította, ahogy a Campus CodeWorks kezeli a felhő erőforrásokat. Az IaC lehetővé teszi verziókezelt infrastruktúrát, megismételhető telepítéseket és könnyebb katasztrófa helyreállítást. Csapataink az IaC-t használják adatbázisok, számítási példányok és hálózati erőforrások kiépítéséhez Campus CodeWorks alkalmazásokhoz. Ez a megközelítés csökkenti a manuális konfigurációs hibákat és lehetővé teszi a gyorsabb helyreállítást infrastruktúra hibákból. Az IaC különösen értékes több környezetes beállításokhoz, ahol a fejlesztési, staging és éles környezeteknek konzisztensnek kell lenniük.</p>"
  },
  {
    "name": "Continuous Integration/Continuous Deployment",
    "ring": "Adopt",
    "quadrant": "Techniques",
    "isNew": "FALSE",
    "description": "<p><strong>Continuous Integration/Continuous Deployment (CI/CD)</strong> pipeline-ok standard gyakorlattá váltak a Campus CodeWorks fejlesztői csapatai számára. Az automatizált tesztelés és telepítés csökkenti a hibák bevezetésének kockázatát éles rendszerekbe. A CI/CD lehetővé teszi a funkciók és javítások gyorsabb szállítását, ami kritikus a változó követelményekre való reagáláshoz. Csapataink a CI/CD-t használják automatikus tesztek futtatásához, biztonsági szkennelésekhez és staging környezetekbe történő telepítéshez, mielőtt manuálisan élesbe kerülnének.</p>"
  },
  {
    "name": "Event-driven architecture",
    "ring": "Assess",
    "quadrant": "Techniques",
    "isNew": "TRUE",
    "description": "<p><strong>Eseményvezérelt architektúra</strong> a Campus CodeWorks által értékelt megközelítés különböző rendszerek integrálásához, amelyeknek valós időben kell reagálniuk változásokra. Például, amikor egy felhasználó regisztrál egy szolgáltatásra, több rendszert is értesíteni kell. Az eseményvezérelt minták message queue-k vagy esemény stream-ek használatával decouple-olhatják ezeket a rendszereket és javíthatják a rugalmasságot. Azonban az eseményvezérelt architektúra implementálása körültekintő tervezést igényel az esemény sorrend kezeléséhez, idempotenciához és hibakezeléshez. Ezt a mintát specifikus integrációs forgatókönyvekhez értékeljük, ahol a laza csatolás egyértelmű előnyöket nyújt.</p>"
  },
  {
    "name": "Single Sign-On (SSO)",
    "ring": "Adopt",
    "quadrant": "Techniques",
    "isNew": "FALSE",
    "description": "<p><strong>Single Sign-On (SSO)</strong> olyan protokollokkal, mint a SAML és OAuth, elengedhetetlen a zökkenőmentes hozzáférés biztosításához Campus CodeWorks alkalmazásokhoz. Az SSO javítja a felhasználói élményt azáltal, hogy megszünteti a több jelszó megjegyzésének szükségességét, miközben javítja a biztonságot központosított autentikációval. A Campus CodeWorks az SSO-t használja különböző rendszerek integrálásához, ügyfélportálokhoz és adminisztratív eszközökhöz. Az SSO jobb hozzáférés-vezérlést és audit nyomvonalakat is lehetővé tesz, ami kritikus a megfelelőségi követelményekhez.</p>"
  },
  {
    "name": "Data warehousing for analytics",
    "ring": "Assess",
    "quadrant": "Techniques",
    "isNew": "TRUE",
    "description": "<p><strong>Adatraktározás analitikához</strong> lehetővé teszi a Campus CodeWorks számára, hogy betekintést nyerjen működési adatokból különböző rendszerekből. Több forrásból származó adatok adatraktárba történő konszolidálásával analitikai csapataink kutatásokat végezhetnek, metrikákat követhetnek és jelentéseket generálhatnak. Az adatraktározás olyan használati eseteket támogat, mint a kockázatos felhasználók azonosítása, teljesítési arányok elemzése és erőforrás allokáció optimalizálása. ETL folyamatokat használunk a működési rendszerek rendszeres szinkronizálásához az adatraktárral, miközben fenntartjuk az adatvédelmet és biztonságot.</p>"
  },
  {
    "name": "Mobile-first design",
    "ring": "Adopt",
    "quadrant": "Techniques",
    "isNew": "FALSE",
    "description": "<p><strong>Mobile-first design</strong> elengedhetetlen a Campus CodeWorks alkalmazásokhoz, mivel a felhasználók egyre gyakrabban okostelefonokról és tabletekről érik el a szolgáltatásokat. Csapataink prioritást adnak a mobil élményeknek regisztrációkhoz, térképekhez, esemény naptárakhoz és ügyfélportálokhoz. A mobile-first design biztosítja, hogy a kritikus funkcionalitás elérhető legyen kis képernyőkön és érintőfelületeken. A reszponzív web design és progresszív webalkalmazás (PWA) technikák lehetővé teszik app-szerű élmények nyújtását natív alkalmazás fejlesztés nélkül minden platformhoz. A mobile-first gondolkodás standard gyakorlattá vált minden új Campus CodeWorks alkalmazás projekthez.</p>"
  },
  {
    "name": "Container orchestration",
    "ring": "Assess",
    "quadrant": "Techniques",
    "isNew": "TRUE",
    "description": "<p><strong>Konténer orchestration</strong> olyan platformokkal, mint a Kubernetes, a Campus CodeWorks által értékelt megközelítés összetett alkalmazás telepítések kezeléséhez. A konténer orchestration lehetővé teszi az automatikus skálázást, öngyógyítást és rolling update-eket, ami értékes magas rendelkezésre állású rendszerekhez. Azonban az orchestration platformok jelentős működési komplexitást vezetnek be és szakértelmet igényelnek. Csapataink értékelik, hogy az előnyök megérnék-e a tanulási görbét és karbantartási terhelést. Kisebb projektek esetében egyszerűbb telepítési stratégiák lehetnek megfelelőbbek, míg nagyobb projektek dedikált DevOps csapatokkal előnyöket nyerhetnek az orchestration képességekből.</p>"
  },
  {
    "name": "Serverless architecture",
    "ring": "Assess",
    "quadrant": "Techniques",
    "isNew": "TRUE",
    "description": "<p><strong>Serverless architektúra</strong> olyan platformokkal, mint az AWS Lambda és Azure Functions, a Campus CodeWorks által értékelt megközelítés specifikus használati esetekhez. A serverless csökkentheti a működési terhelést szerver kezelés megszüntetésével és automatikus skálázás engedélyezésével. Csapataink a serverless-t értékelik eseményvezérelt integrációkhoz, ütemezett feladatokhoz, mint adatszinkronizáció, és változó forgalmi mintákkal rendelkező API végpontokhoz. Azonban a serverless kihívásokat vezet be cold start-ok, debugging és vendor lock-in terén. A serverless-t specifikus forgatókönyvekhez értékeljük, ahol az előnyök felülmúlják a kompromisszumokat, nem pedig teljes körű helyettesítésként a hagyományos szerver-alapú architektúrák helyett.</p>"
  },
  {
    "name": "Observability and monitoring",
    "ring": "Adopt",
    "quadrant": "Techniques",
    "isNew": "FALSE",
    "description": "<p><strong>Megfigyelhetőség és monitoring</strong> olyan eszközökkel, mint a Prometheus, Grafana és alkalmazás teljesítmény monitoring (APM) megoldások, elengedhetetlen a megbízható Campus CodeWorks szolgáltatások fenntartásához. Összetettebb rendszerekben, mint a KAV vizsgaszervező platform, ezt kiegészítjük EFK stackkel (Elasticsearch, Fluentd/Fluent Bit, Kibana) a központosított logoláshoz és OpenTelemetry alapú tracinggel (Jaeger/Tempo). Az átfogó monitoring lehetővé teszi csapataink számára, hogy problémákat észleljenek, mielőtt azok hatással lennének a felhasználókra, megértsék a rendszer teljesítményét csúcsidőszakokban és gyorsan elhárítsák a problémákat. Többszintű monitoringot implementálunk: infrastruktúra metrikák, alkalmazás teljesítmény és üzleti metrikák. A hatékony megfigyelhetőség kritikus a szolgáltatási szintű megállapodások fenntartásához és pozitív felhasználói élmények biztosításához.</p>"
  },
  {
    "name": "MSSQL",
    "ring": "Adopt",
    "quadrant": "Platforms",
    "isNew": "TRUE",
    "description": "<p><strong><a href=\"https://www.microsoft.com/sql-server\">Microsoft SQL Server (MSSQL)</a></strong> a Campus CodeWorks által használatban lévő relációs adatbázis-kezelő rendszer. Csapataink az MSSQL-t használják vállalati alkalmazásokhoz, ahol a Windows ökoszisztéma és a .NET integráció elsődleges. Az MSSQL erős tranzakciókezelése, biztonsági funkciói és az Azure SQL integráció lehetősége megbízható választást nyújt kritikus üzleti adatok tárolásához.</p>"
  },
  {
    "name": "Oracle",
    "ring": "Adopt",
    "quadrant": "Platforms",
    "isNew": "TRUE",
    "description": "<p><strong><a href=\"https://www.oracle.com/database/\">Oracle Database</a></strong> a Campus CodeWorks által használatban lévő relációs adatbázis rendszer. Az Oracle-t olyan projektekben és ügyfelekkel használjuk, ahol már meglévő Oracle infrastruktúra vagy licenszelési megállapodások vannak. Az Oracle erős adatintegritási és skálázhatósági képességei megfelelnek nagyvállalati igényeknek.</p>"
  },
  {
    "name": "ELK Stack",
    "ring": "Adopt",
    "quadrant": "Platforms",
    "isNew": "TRUE",
    "description": "<p><strong><a href=\"https://www.elastic.co/elasticstack\">ELK Stack</a></strong> (Elasticsearch, Logstash, Kibana) a Campus CodeWorks által használatban lévő központosított loggyűjtési, keresési és vizualizációs platform. Csapataink az ELK stacket használják alkalmazás- és infrastruktúra logok összegyűjtéséhez, kereséséhez és dashboardok készítéséhez. A stack kiegészíti a megfigyelhetőségi stratégiát a részletes log elemzés és hibakeresés támogatásával.</p>"
  },
  {
    "name": "ChatGPT",
    "ring": "Adopt",
    "quadrant": "Tools",
    "isNew": "TRUE",
    "description": "<p><strong><a href=\"https://chat.openai.com/\">ChatGPT</a></strong> a Campus CodeWorks által használatban lévő AI-alapú asszisztens dokumentációhoz, kód példákhoz, és általános fejlesztési kérdésekhez. Csapataink a ChatGPT-t használják gyors információkeresésre, sablonok és dokumentumok piszkozatolására, valamint ötletgyűjtésre. A tool segíti a produktivitást, miközben a szervezeti adatkezelési irányelvek betartása mellett használjuk.</p>"
  },
  {
    "name": "Cursor AI",
    "ring": "Trial",
    "quadrant": "Tools",
    "isNew": "TRUE",
    "description": "<p><strong><a href=\"https://cursor.com/\">Cursor AI</a></strong> jelenleg nem használatban a Campus CodeWorks-nál, de bevezetését érdemes megfontolni. A Cursor AI-alapú kódszerkesztő, amely kontextusérzékeny javaslatokat és kódgenerálást nyújt a fejlesztők számára. A bevezetés előtt érdemes kipróbálni a biztonsági és adatkezelési szabályzatokkal való összeegyeztethetőségét.</p>"
  },
  {
    "name": "Claude Code",
    "ring": "Assess",
    "quadrant": "Tools",
    "isNew": "TRUE",
    "description": "<p><strong><a href=\"https://claude.ai/\">Claude (Claude Code)</a></strong> jelenleg nem használatban a Campus CodeWorks-nál; megvizsgálásra javasolt. Az Anthropic által készített AI asszisztens kódértelmezést, dokumentációt és fejlesztési támogatást nyújt. Értékelni kell a szervezeti igényekhez való illeszkedést, licenszelést és a meglévő AI eszközök (pl. ChatGPT) melletti használatot.</p>"
  },
  {
    "name": "Proxmox VE",
    "ring": "Assess",
    "quadrant": "Platforms",
    "isNew": "TRUE",
    "description": "<p><strong><a href=\"https://www.proxmox.com/\">Proxmox VE</a></strong> jelenleg nem használatban; a virtualizáció bővítése érdekében megvizsgálásra javasolt. A Proxmox nyílt forráskódú, KVM- és LXC-alapú virtualizációs platform, amely on-premise szerverek és VMs kezelését teszi lehetővé. Értékelni kell a meglévő infrastruktúrával való összeegyeztethetőséget és üzemeltetési költségeket.</p>"
  },
  {
    "name": "VMware ESXi",
    "ring": "Assess",
    "quadrant": "Platforms",
    "isNew": "TRUE",
    "description": "<p><strong><a href=\"https://www.vmware.com/products/esxi-and-esx.html\">VMware ESXi</a></strong> jelenleg nem használatban; a virtualizáció bevezetése vagy bővítése érdekében megvizsgálásra javasolt. Az ESXi iparági standard hypervisor nagy rendelkezésre állású, skálázható virtuális környezetekhez. Értékelni kell a licenszelési költségeket a Proxmox és egyéb alternatívákhoz képest, valamint a szervezet virtualizációs stratégiájához való illeszkedést.</p>"
  }
]
